---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.RoofFailures
source: html/c71f85b8-23b8-4dd5-3aa3-90df6d72f0de.htm
---
# BuiltInFailures.RoofFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.